name: "Scalar Sum"

layer {
    name: "A"
    type: "DummyData"
    top: "A"
    dummy_data_param {
        data_filler {
            type: "constant"
            value: 1.0
        }
        shape {
            dim:1
        }
    }
}

layer {
    name: "B"
    type: "DummyData"
    top: "B"
    dummy_data_param {
        data_filler {
            type: "constant"
            value: 3.0
        }
        shape {
            dim:1
        }
    }
}

layer {
    name: "C"
    type: "Eltwise"
    top: "C"
    bottom: "A"
    bottom: "B"
    eltwise_param {
        operation: SUM
    }
}
